Catalogs/упСтилиЛиний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упСтилиЛиний</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.упСтилиПолигонов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Толщина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прозрачность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/упСтилиЛиний/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура производит первоначальное заполнение справочника.
//
Процедура ПервоначальноеЗаполнение() Экспорт
	
	текЭлемент = Справочники.упСтилиЛиний.Основной.ПолучитьОбъект();
	текЭлемент.Наименование = НСтр("ru = 'Синий'");
	текЭлемент.Цвет         = "#0000FF";
	текЭлемент.Толщина      = 2;
	текЭлемент.Прозрачность = 0;
	текЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Белый'");
	НовыйЭлемент.Цвет         = "#FFFFFF";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Голубой'");
	НовыйЭлемент.Цвет         = "#00FFFF";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Желтый'");
	НовыйЭлемент.Цвет         = "#FFFF00";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Зеленый'");
	НовыйЭлемент.Цвет         = "#00FF00";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Красный'");
	НовыйЭлемент.Цвет         = "#FF0000";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Оранжевый'");
	НовыйЭлемент.Цвет         = "#FFA500";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Розовый'");
	НовыйЭлемент.Цвет         = "#FFC0CB";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Серый'");
	НовыйЭлемент.Цвет         = "#BEBEBE";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Фиолетовый'");
	НовыйЭлемент.Цвет         = "#EE82EE";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.упСтилиЛиний.СоздатьЭлемент();
	НовыйЭлемент.Наименование = НСтр("ru = 'Черный'");
	НовыйЭлемент.Цвет         = "#000000";
	НовыйЭлемент.Толщина      = 2;
	НовыйЭлемент.Прозрачность = 0;
	НовыйЭлемент.Записать();
	
КонецПроцедуры	

#КонецОбласти
